system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     pimpleFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         1;

deltaT          0.001;

writeControl    adjustableRunTime;  // 恢复按时间输出

writeInterval   0.2;     // 每0.1秒输出一次

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

adjustTimeStep  yes;

maxCo           5;

functions
{
    // 被动标量场C求解设置
    scalarTransport
    {
        type            scalarTransport;
        libs            ("libsolverFunctionObjects.dll");
        
        // 场配置
        field           C;
        phi             phi;
        rho             none;
        D               1.5e-05;
        
        // 离散格式
        schemes
        {
            ddt(C)      Euler;
            div(phi,C)  Gauss limitedLinear 1;
            div(D,C)    Gauss linear;
        };
        

        fvOptions
        {
            pollutantSource
            {
                type            scalarFixedValueConstraint;
                active          yes;

                dimensions      [0 0 0 0 0 0 0];      // 无量纲

                scalarFixedValueConstraintCoeffs
                {
                    // 明确指定字段名
                    fieldName       C;
                    // 使用cellZone选择模式
                    selectionMode   cellZone;
                    cellZone        sourceZone;
                    volumeMode      absolute;  // 绝对体积源项
                    
                    // 设置固定值
                    fieldValues
                    {
                        C     4.0;
                    }
                }
            }
        }     
    }
}