system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (0 0 0)
    (1.04 0 0)
    (1.04 0.024 0)
    (0 0.024 0)

    (0 0 0.09)
    (1.04 0 0.09)
    (1.04 0.024 0.09)
    (0 0.024 0.09)

    (0 1.022 0)
    (1.04 1.022 0)
    (1.04 1.04 0)
    (0 1.04 0)

    (0 1.022 0.09)
    (1.04 1.022 0.09)
    (1.04 1.04 0.09)
    (0 1.04 0.09)
);

blocks
(
    hex (0 1 2 3 4 5 6 7)(74 2 1)simpleGrading (1 1 1)
    hex (3 2 9 8 7 6 13 12)(74 71 1)simpleGrading (1 1 1)
    hex (8 9 10 11 12 13 14 15)(74 2 1)simpleGrading (1 1 1)
);

defaultPatch
{
    name walls;
    type wall;
}

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (8 12 15 11)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (6 5 1 2)
        );
    }
    walls
    {
        type wall;
        faces
        (
            (3 7 12 8)
            (0 4 7 3)
            (14 13 9 10)
            (2 9 13 6)
            (11 15 14 10)
            (0 1 5 4)
        );
    }
    frontAndBack
    {    
        type empty;
        faces
        (
            (0 3 2 1)
            (3 8 9 2)
            (8 11 10 9)
            (4 5 6 7)
            (7 6 13 12)
            (12 13 14 15)
        );
    }
);


// ************************************************************************* //
