system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
defaultFieldValues
(
    volScalarFieldValue C 0  // 默认全场为0
);

regions
(
    boxToCell
    {
        box (0.5 0.5 0) (0.6 0.6 0.09);  // 与topoSetDict相同的区域坐标
        fieldValues
        (
            volScalarFieldValue C 1     // 初始浓度设为1
        );
    }
);